app/views/toons/index.html.erb

    <td><%= toon.role.name %></td>
    <td><%= toon.wants.length %></td>
---
SELECT "wants".* FROM "wants" WHERE ("wants".toon_id = 1)