app/views/toons/show.html.erb

SELECT "wants".* FROM "wants" WHERE ("wants".toon_id = 5) ORDER BY boss_id
---
  </tr>
  <%= render :partial => @toon.wants.order('boss_id') %>