app/controllers/bosses_controller.rb

  def index
    @bosses = Boss.all
---
SELECT "bosses".* FROM "bosses" ORDER BY boss_id

  def show
    @boss = Boss.find(params[:id])
---
SELECT "bosses".* FROM "bosses" WHERE ("bosses"."id" = 0) LIMIT 1

  def edit
    @boss = Boss.find(params[:id])
---
SELECT "bosses".* FROM "bosses" WHERE ("bosses"."id" = 9) LIMIT 1

  def create
    @boss = Boss.new(params[:boss])

    respond_to do |format|
      if @boss.save
---
INSERT INTO "bosses" ("boss_id", "created_at", "name", "updated_at", "wing_id") VALUES (1, '2010-09-08 22:29:58.097593', 'Lord Marrowgar', '2010-09-08 22:29:58.097593', 1)

  def update
    @boss = Boss.find(params[:id])

    respond_to do |format|
      if @boss.update_attributes(params[:boss])
---
SELECT "bosses".* FROM "bosses" WHERE ("bosses"."id" = 9) LIMIT 1
UPDATE "bosses" SET "name" = 'Blood-Queen Lana''thel', "updated_at" = '2010-09-09 07:55:52.998246' WHERE ("bosses"."id" = 9)