app/controllers/toons_controller.rb

SELECT "toons".* FROM "toons" ORDER BY name
---
  def index
    @toons = Toon.all

SELECT "toons".* FROM "toons" WHERE ("toons"."id" = 1) LIMIT 1
---
  def show
    @toon = Toon.find(params[:id])

SELECT "toons".* FROM "toons" WHERE ("toons"."id" = 2) LIMIT 1
---
  def edit
    @toon = Toon.find(params[:id])

INSERT INTO "toons" ("created_at", "name", "role_id", "toon_id", "updated_at") VALUES ('2010-09-08 22:43:05.839836', 'Mirenu', 1, NULL, '2010-09-08 22:43:05.839836')
---
  def create
    @toon = Toon.new(params[:toon])

    respond_to do |format|
      if @toon.save

SELECT "toons".* FROM "toons" WHERE ("toons"."id" = 5) LIMIT 1
---
  def update
    @toon = Toon.find(params[:id])

SELECT "toons".* FROM "toons" WHERE ("toons"."id" = 2) LIMIT 1
DELETE FROM "toons" WHERE ("toons"."id" = 2)
---
  def destroy
    @toon = Toon.find(params[:id])
    @toon.destroy