app/controllers/wants_controller.rb

SELECT "wants".* FROM "wants" ORDER BY boss_id
---
  def index
    if params[:itemsPerPage] then session[:itemsPerPage] = params[:itemsPerPage] end
    if params[:page] then @page = params[:page].to_i else @page = 1 end
    if session[:itemsPerPage] then @per = session[:itemsPerPage].to_i else @per = 15 end

    @wants = Want.find(:all, :order => 'boss_id')
    @lastpage = @wants.length/(@per) + 1

SELECT "wants".* FROM "wants" WHERE ("wants"."id" = 1) LIMIT 1
---
  def show
    @want = Want.find(params[:id])

INSERT INTO "wants" ("boss_id", "created_at", "item_id", "item_name", "toon_id", "updated_at") VALUES (1, '2010-09-09 03:58:24.588142', 50612, 'Legguards of Lost Hope', 1, '2010-09-09 03:58:24.588142')
---
  def create
    @want = Want.new(params[:want])

    respond_to do |format|
      if @want.save

SELECT "wants".* FROM "wants" WHERE ("wants"."id" = 2) LIMIT 1
DELETE FROM "wants" WHERE ("wants"."id" = 2)
---
  def destroy
    @want = Want.find(params[:id])
    @want.destroy