app/controllers/wings_controller.rb

SELECT "wings".* FROM "wings" ORDER BY wing_id
---
  def index
    @wings = Wing.all

SELECT "wings".* FROM "wings" WHERE ("wings"."id" = 1) LIMIT 1
---
  def show
    @wing = Wing.find(params[:id])

INSERT INTO "wings" ("created_at", "name", "updated_at", "wing_id") VALUES ('2010-09-08 22:20:42.681804', 'Assault Wing', '2010-09-08 22:20:42.681804', 1)
---
  def create
    @wing = Wing.new(params[:wing])

    respond_to do |format|
      if @wing.save