app/views/bosses/index.html.erb

SELECT "toons".* FROM "toons" INNER JOIN "wants" ON "toons".id = "wants".toon_id WHERE (("wants".boss_id = 1))
---
    <td><%= link_to boss.wing.name, boss.wing %></td>
    <td><%= boss.toons.length %></td>