app/views/bosses/show.html.erb

  </tr>
  <%= render :partial => @boss.wants.order('toon_id') %>
---
SELECT "wants".* FROM "wants" WHERE ("wants".boss_id = 9) ORDER BY toon_id